[Killed] BlockStatement
src/context/AuthContext.jsx:10:19
   const [user, setUser] = useState(null);
   const [token, setToken] = useState(localStorage.getItem("token"));
 
-  useEffect(() => {
-    if (token) {
-      axios.defaults.headers.common["Authorization"] = `Bearer ${token}`;
-      axios
-        .get("http://localhost:3000/api/users/me")
-        .then((res) => {
-          setUser(res.data);
-        })
-        .catch(() => {
-          logout();
-        });
-    } else {
-      delete axios.defaults.headers.common["Authorization"];
-    }
-  }, [token]);
+  useEffect(() => {}, [token]);
 
   const login = async (email, password) => {
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected undefined to be 'Bearer jwt-token-abc' // Object.is equality

[Killed] BlockStatement
src/context/AuthContext.jsx:11:16
   const [token, setToken] = useState(localStorage.getItem("token"));
 
   useEffect(() => {
-    if (token) {
-      axios.defaults.headers.common["Authorization"] = `Bearer ${token}`;
-      axios
-        .get("http://localhost:3000/api/users/me")
-        .then((res) => {
-          setUser(res.data);
-        })
-        .catch(() => {
-          logout();
-        });
-    } else {
+    if (token) {} else {
       delete axios.defaults.headers.common["Authorization"];
     }
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected undefined to be 'Bearer jwt-token-abc' // Object.is equality

[Killed] ConditionalExpression
src/context/AuthContext.jsx:11:9
   const [token, setToken] = useState(localStorage.getItem("token"));
 
   useEffect(() => {
-    if (token) {
+    if (false) {
       axios.defaults.headers.common["Authorization"] = `Bearer ${token}`;
       axios
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected undefined to be 'Bearer jwt-token-abc' // Object.is equality

[Killed] StringLiteral
src/context/AuthContext.jsx:14:14
     if (token) {
       axios.defaults.headers.common["Authorization"] = `Bearer ${token}`;
       axios
-        .get("http://localhost:3000/api/users/me")
+        .get("")
         .then((res) => {
           setUser(res.data);
killedBy: Login -> Checkout (chained integration) restores the logged-in user from an existing session token on mount
statusReason: expected {} to deeply equal { id: 7, name: 'Nguyen Van A', …(1) }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/context/AuthContext.jsx:15:24
       axios.defaults.headers.common["Authorization"] = `Bearer ${token}`;
       axios
         .get("http://localhost:3000/api/users/me")
-        .then((res) => {
-          setUser(res.data);
-        })
+        .then((res) => {})
         .catch(() => {
           logout();
killedBy: Login -> Checkout (chained integration) restores the logged-in user from an existing session token on mount
statusReason: expected null to deeply equal { id: 7, name: 'Nguyen Van A', …(1) }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[NoCoverage] BlockStatement
src/context/AuthContext.jsx:18:22
         .then((res) => {
           setUser(res.data);
         })
-        .catch(() => {
-          logout();
-        });
+        .catch(() => {});
     } else {
       delete axios.defaults.headers.common["Authorization"];

[Killed] BlockStatement
src/context/AuthContext.jsx:21:12
         .catch(() => {
           logout();
         });
-    } else {
-      delete axios.defaults.headers.common["Authorization"];
-    }
+    } else {}
   }, [token]);
 
killedBy: Login -> Checkout (chained integration) clears the Authorization default header once logout() runs after a login()
statusReason: expected 'Bearer jwt-token-abc' to be undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/context/AuthContext.jsx:22:44
           logout();
         });
     } else {
-      delete axios.defaults.headers.common["Authorization"];
+      delete axios.defaults.headers.common[""];
     }
   }, [token]);
killedBy: Login -> Checkout (chained integration) clears the Authorization default header once logout() runs after a login()
statusReason: expected 'Bearer jwt-token-abc' to be undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
src/context/AuthContext.jsx:24:6
     } else {
       delete axios.defaults.headers.common["Authorization"];
     }
-  }, [token]);
+  }, []);
 
   const login = async (email, password) => {
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected undefined to be 'Bearer jwt-token-abc' // Object.is equality

[Killed] BlockStatement
src/context/AuthContext.jsx:26:44
     }
   }, [token]);
 
-  const login = async (email, password) => {
-    const res = await axios.post("http://localhost:3000/api/login", {
-      email,
-      password,
-    });
-    setToken(res.data.token);
-    localStorage.setItem("token", res.data.token);
-    setUser(res.data.user);
-    return res.data;
-  };
+  const login = async (email, password) => {};
 
   const logout = () => {
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
src/context/AuthContext.jsx:27:69
   }, [token]);
 
   const login = async (email, password) => {
-    const res = await axios.post("http://localhost:3000/api/login", {
-      email,
-      password,
-    });
+    const res = await axios.post("http://localhost:3000/api/login", {});
     setToken(res.data.token);
     localStorage.setItem("token", res.data.token);
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "http://localhost:3000/api/login",

[Killed] BlockStatement
src/context/AuthContext.jsx:37:24
     return res.data;
   };
 
-  const logout = () => {
-    setToken(null);
-    setUser(null);
-    localStorage.removeItem("token");
-  };
+  const logout = () => {};
 
   return (
killedBy: Login -> Checkout (chained integration) clears the Authorization default header once logout() runs after a login()
statusReason: expected 'Bearer jwt-token-abc' to be undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] StringLiteral
src/context/AuthContext.jsx:40:29
   const logout = () => {
     setToken(null);
     setUser(null);
-    localStorage.removeItem("token");
+    localStorage.removeItem("");
   };
 

[Killed] ArrowFunction
src/context/AuthContext.jsx:50:24
   );
 };
 
-export const useAuth = () => useContext(AuthContext);
+export const useAuth = () => undefined;
 
killedBy: Login -> Checkout (chained integration) renders the checkout page heading
statusReason: Cannot destructure property 'token' of 'useAuth(...)' as it is undefined.
