[Killed] BooleanLiteral
src/pages/Checkout.jsx:11:42
   const { cart, cartTotal, clearCart } = useCart();
   const { token, user } = useAuth();
   const navigate = useNavigate();
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [success, setSuccess] = useState(false);
 
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: Unable to find an element with the text: Xác Nhận Thanh Toán. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BooleanLiteral
src/pages/Checkout.jsx:12:42
   const { token, user } = useAuth();
   const navigate = useNavigate();
   const [loading, setLoading] = useState(false);
-  const [success, setSuccess] = useState(false);
+  const [success, setSuccess] = useState(true);
 
   const [editableTotal, setEditableTotal] = useState(cartTotal);
killedBy: Login -> Checkout (chained integration) renders the checkout page heading
statusReason: Unable to find an element with the text: Xác Nhận Đơn Hàng. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="text-center mt-10"
    >

[Killed] StringLiteral
src/pages/Checkout.jsx:19:50
   // Coupon state
   const [couponCode, setCouponCode] = useState('');
   const [couponResult, setCouponResult] = useState(null);
-  const [couponError, setCouponError] = useState('');
+  const [couponError, setCouponError] = useState("Stryker was here!");
   const [applyingCoupon, setApplyingCoupon] = useState(false);
 
killedBy: Login -> Checkout (chained integration) shows no coupon error banner before any coupon has been applied
statusReason: expected <p class="mt-2 text-red-600 text-sm"></p> to be null

[Killed] BooleanLiteral
src/pages/Checkout.jsx:20:56
   const [couponCode, setCouponCode] = useState('');
   const [couponResult, setCouponResult] = useState(null);
   const [couponError, setCouponError] = useState('');
-  const [applyingCoupon, setApplyingCoupon] = useState(false);
+  const [applyingCoupon, setApplyingCoupon] = useState(true);
 
   const handleApplyCoupon = async () => {
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: Áp dụng. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BlockStatement
src/pages/Checkout.jsx:22:41
   const [couponError, setCouponError] = useState('');
   const [applyingCoupon, setApplyingCoupon] = useState(false);
 
-  const handleApplyCoupon = async () => {
-    if (!couponCode.trim()) return;
-    setCouponError('');
-    setCouponResult(null);
-    setApplyingCoupon(true);
-    try {
-      const res = await axios.post('http://localhost:3000/api/apply-coupon', {
-        code: couponCode.trim().toUpperCase(),
-        total_amount: editableTotal,
-        user_id: user?.id || null
-      });
-      setCouponResult(res.data);
-    } catch (err) {
-      setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
-    }
-    setApplyingCoupon(false);
-  };
+  const handleApplyCoupon = async () => {};
 
   const handleCheckout = async () => {
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BooleanLiteral
src/pages/Checkout.jsx:23:9
   const [applyingCoupon, setApplyingCoupon] = useState(false);
 
   const handleApplyCoupon = async () => {
-    if (!couponCode.trim()) return;
+    if (couponCode.trim()) return;
     setCouponError('');
     setCouponResult(null);
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:23:9
   const [applyingCoupon, setApplyingCoupon] = useState(false);
 
   const handleApplyCoupon = async () => {
-    if (!couponCode.trim()) return;
+    if (true) return;
     setCouponError('');
     setCouponResult(null);
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BooleanLiteral
src/pages/Checkout.jsx:26:23
     if (!couponCode.trim()) return;
     setCouponError('');
     setCouponResult(null);
-    setApplyingCoupon(true);
+    setApplyingCoupon(false);
     try {
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
killedBy: Login -> Checkout (chained integration) shows the transient "..." / "Đang xử lý..." labels while the coupon/checkout requests are in flight
statusReason: Unable to find an element with the text: .... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BlockStatement
src/pages/Checkout.jsx:27:9
     setCouponError('');
     setCouponResult(null);
     setApplyingCoupon(true);
-    try {
-      const res = await axios.post('http://localhost:3000/api/apply-coupon', {
-        code: couponCode.trim().toUpperCase(),
-        total_amount: editableTotal,
-        user_id: user?.id || null
-      });
-      setCouponResult(res.data);
-    } catch (err) {
+    try {} catch (err) {
       setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
     }
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ObjectLiteral
src/pages/Checkout.jsx:28:78
     setCouponResult(null);
     setApplyingCoupon(true);
     try {
-      const res = await axios.post('http://localhost:3000/api/apply-coupon', {
-        code: couponCode.trim().toUpperCase(),
-        total_amount: editableTotal,
-        user_id: user?.id || null
-      });
+      const res = await axios.post('http://localhost:3000/api/apply-coupon', {});
       setCouponResult(res.data);
     } catch (err) {
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/apply-coupon",

[Killed] MethodExpression
src/pages/Checkout.jsx:29:15
     setApplyingCoupon(true);
     try {
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
-        code: couponCode.trim().toUpperCase(),
+        code: couponCode.trim().toLowerCase(),
         total_amount: editableTotal,
         user_id: user?.id || null
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/apply-coupon",

[Survived] MethodExpression
src/pages/Checkout.jsx:29:15
     setApplyingCoupon(true);
     try {
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
-        code: couponCode.trim().toUpperCase(),
+        code: couponCode.toUpperCase(),
         total_amount: editableTotal,
         user_id: user?.id || null

[Killed] ConditionalExpression
src/pages/Checkout.jsx:31:18
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
         code: couponCode.trim().toUpperCase(),
         total_amount: editableTotal,
-        user_id: user?.id || null
+        user_id: false
       });
       setCouponResult(res.data);
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/apply-coupon",

[Killed] LogicalOperator
src/pages/Checkout.jsx:31:18
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
         code: couponCode.trim().toUpperCase(),
         total_amount: editableTotal,
-        user_id: user?.id || null
+        user_id: user?.id && null
       });
       setCouponResult(res.data);
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/apply-coupon",

[Killed] BlockStatement
src/pages/Checkout.jsx:34:19
         user_id: user?.id || null
       });
       setCouponResult(res.data);
-    } catch (err) {
-      setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
-    }
+    } catch (err) {}
     setApplyingCoupon(false);
   };
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] LogicalOperator
src/pages/Checkout.jsx:35:22
       });
       setCouponResult(res.data);
     } catch (err) {
-      setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
+      setCouponError(err.response?.data?.error && 'Không thể áp dụng mã');
     }
     setApplyingCoupon(false);
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] OptionalChaining
src/pages/Checkout.jsx:35:22
       });
       setCouponResult(res.data);
     } catch (err) {
-      setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
+      setCouponError(err.response.data?.error || 'Không thể áp dụng mã');
     }
     setApplyingCoupon(false);
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Survived] BooleanLiteral
src/pages/Checkout.jsx:37:23
     } catch (err) {
       setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
     }
-    setApplyingCoupon(false);
+    setApplyingCoupon(true);
   };
 

[Killed] BooleanLiteral
src/pages/Checkout.jsx:41:16
   };
 
   const handleCheckout = async () => {
-    setLoading(true);
+    setLoading(false);
     try {
       const finalAmount = couponResult ? couponResult.final_amount : editableTotal;
killedBy: Login -> Checkout (chained integration) shows the transient "..." / "Đang xử lý..." labels while the coupon/checkout requests are in flight
statusReason: Unable to find an element with the text: Đang xử lý.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BlockStatement
src/pages/Checkout.jsx:42:9
 
   const handleCheckout = async () => {
     setLoading(true);
-    try {
-      const finalAmount = couponResult ? couponResult.final_amount : editableTotal;
-
-      await axios.post('http://localhost:3000/api/checkout', {
-        items: cart,
-        total_amount: finalAmount,
-        coupon_id: couponResult?.coupon_id || null
-      }, {
-        headers: token ? { Authorization: `Bearer ${token}` } : {}
-      });
-
-      // Record coupon usage if applied
-      if (couponResult?.coupon_id && token) {
-        await axios.post('http://localhost:3000/api/coupon-usage',
-          { coupon_id: couponResult.coupon_id },
-          { headers: { Authorization: `Bearer ${token}` } }
-        );
-      }
-
-      setSuccess(true);
-    } catch (err) {
+    try {} catch (err) {
       alert("Lỗi khi thanh toán: " + (err.response?.data?.error || err.message));
     }
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/checkout",

[Killed] StringLiteral
src/pages/Checkout.jsx:45:24
     try {
       const finalAmount = couponResult ? couponResult.final_amount : editableTotal;
 
-      await axios.post('http://localhost:3000/api/checkout', {
+      await axios.post("", {
         items: cart,
         total_amount: finalAmount,
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/checkout",

[Killed] LogicalOperator
src/pages/Checkout.jsx:48:20
       await axios.post('http://localhost:3000/api/checkout', {
         items: cart,
         total_amount: finalAmount,
-        coupon_id: couponResult?.coupon_id || null
+        coupon_id: couponResult?.coupon_id && null
       }, {
         headers: token ? { Authorization: `Bearer ${token}` } : {}
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/checkout",

[Killed] OptionalChaining
src/pages/Checkout.jsx:48:20
       await axios.post('http://localhost:3000/api/checkout', {
         items: cart,
         total_amount: finalAmount,
-        coupon_id: couponResult?.coupon_id || null
+        coupon_id: couponResult.coupon_id || null
       }, {
         headers: token ? { Authorization: `Bearer ${token}` } : {}
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/checkout",

[Killed] ObjectLiteral
src/pages/Checkout.jsx:49:10
         items: cart,
         total_amount: finalAmount,
         coupon_id: couponResult?.coupon_id || null
-      }, {
-        headers: token ? { Authorization: `Bearer ${token}` } : {}
-      });
+      }, {});
 
       // Record coupon usage if applied
killedBy: Login -> Checkout (chained integration) uses the token issued by login() to authorize the checkout request
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/checkout",

[Killed] BlockStatement
src/pages/Checkout.jsx:54:45
       });
 
       // Record coupon usage if applied
-      if (couponResult?.coupon_id && token) {
-        await axios.post('http://localhost:3000/api/coupon-usage',
-          { coupon_id: couponResult.coupon_id },
-          { headers: { Authorization: `Bearer ${token}` } }
-        );
-      }
+      if (couponResult?.coupon_id && token) {}
 
       setSuccess(true);
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/coupon-usage",

[Killed] LogicalOperator
src/pages/Checkout.jsx:54:11
       });
 
       // Record coupon usage if applied
-      if (couponResult?.coupon_id && token) {
+      if (couponResult?.coupon_id || token) {
         await axios.post('http://localhost:3000/api/coupon-usage',
           { coupon_id: couponResult.coupon_id },
killedBy: Login -> Checkout (chained integration) does NOT record coupon-usage when a coupon was applied but the user is not logged in (coupon_id present, token missing)
statusReason: expected "vi.fn()" to not be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/coupon-usage",

[Killed] StringLiteral
src/pages/Checkout.jsx:55:26
 
       // Record coupon usage if applied
       if (couponResult?.coupon_id && token) {
-        await axios.post('http://localhost:3000/api/coupon-usage',
+        await axios.post("",
           { coupon_id: couponResult.coupon_id },
           { headers: { Authorization: `Bearer ${token}` } }
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/coupon-usage",

[Killed] ObjectLiteral
src/pages/Checkout.jsx:57:11
       if (couponResult?.coupon_id && token) {
         await axios.post('http://localhost:3000/api/coupon-usage',
           { coupon_id: couponResult.coupon_id },
-          { headers: { Authorization: `Bearer ${token}` } }
+          {}
         );
       }
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "http://localhost:3000/api/coupon-usage",

[Killed] BooleanLiteral
src/pages/Checkout.jsx:61:18
         );
       }
 
-      setSuccess(true);
+      setSuccess(false);
     } catch (err) {
       alert("Lỗi khi thanh toán: " + (err.response?.data?.error || err.message));
killedBy: Login -> Checkout (chained integration) shows the success screen after a completed checkout
statusReason: Unable to find an element with the text: Thanh toán thành công!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BlockStatement
src/pages/Checkout.jsx:62:19
       }
 
       setSuccess(true);
-    } catch (err) {
-      alert("Lỗi khi thanh toán: " + (err.response?.data?.error || err.message));
-    }
+    } catch (err) {}
     setLoading(false);
   };
killedBy: Login -> Checkout (chained integration) resets the loading state and re-enables the button after a failed checkout
statusReason: expected "bound " to be called with arguments: [ 'Lỗi khi thanh toán: Hết hàng' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/pages/Checkout.jsx:63:39
 
       setSuccess(true);
     } catch (err) {
-      alert("Lỗi khi thanh toán: " + (err.response?.data?.error || err.message));
+      alert("Lỗi khi thanh toán: " + (true));
     }
     setLoading(false);
killedBy: Login -> Checkout (chained integration) resets the loading state and re-enables the button after a failed checkout
statusReason: expected "bound " to be called with arguments: [ 'Lỗi khi thanh toán: Hết hàng' ]

Received:

  1st bound  call:

  [
-   "Lỗi khi thanh toán: Hết hàng",

[Killed] LogicalOperator
src/pages/Checkout.jsx:63:39
 
       setSuccess(true);
     } catch (err) {
-      alert("Lỗi khi thanh toán: " + (err.response?.data?.error || err.message));
+      alert("Lỗi khi thanh toán: " + (err.response?.data?.error && err.message));
     }
     setLoading(false);
killedBy: Login -> Checkout (chained integration) resets the loading state and re-enables the button after a failed checkout
statusReason: expected "bound " to be called with arguments: [ 'Lỗi khi thanh toán: Hết hàng' ]

Received:

  1st bound  call:

  [
-   "Lỗi khi thanh toán: Hết hàng",

[Killed] BlockStatement
src/pages/Checkout.jsx:68:16
     setLoading(false);
   };
 
-  if (success) {
-    return (
-      <div className="text-center mt-10">
-        <h2 className="text-3xl text-green-600 font-bold mb-4">Thanh toán thành công!</h2>
-        <p className="mb-4">Cảm ơn bạn đã mua sắm tại EShop.</p>
-        <button onClick={() => navigate('/')} className="text-blue-600 hover:underline">Quay lại trang chủ</button>
-      </div>
-    );
-  }
+  if (success) {}
 
   return (
killedBy: Login -> Checkout (chained integration) shows the success screen after a completed checkout
statusReason: Unable to find an element with the text: Thanh toán thành công!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:68:7
     setLoading(false);
   };
 
-  if (success) {
+  if (false) {
     return (
       <div className="text-center mt-10">
killedBy: Login -> Checkout (chained integration) shows the success screen after a completed checkout
statusReason: Unable to find an element with the text: Thanh toán thành công!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Survived] ArrowFunction
src/pages/Checkout.jsx:73:26
       <div className="text-center mt-10">
         <h2 className="text-3xl text-green-600 font-bold mb-4">Thanh toán thành công!</h2>
         <p className="mb-4">Cảm ơn bạn đã mua sắm tại EShop.</p>
-        <button onClick={() => navigate('/')} className="text-blue-600 hover:underline">Quay lại trang chủ</button>
+        <button onClick={() => undefined} className="text-blue-600 hover:underline">Quay lại trang chủ</button>
       </div>
     );

[Killed] ArrowFunction
src/pages/Checkout.jsx:85:21
       <div className="mb-6">
         <h3 className="font-semibold mb-2">Sản phẩm:</h3>
         <ul className="list-disc pl-5">
-          {cart.map((item, index) => (
-            <li key={index}>{item.name} x {item.quantity} — {(item.price * item.quantity).toLocaleString()} ₫</li>
-          ))}
+          {cart.map(() => undefined)}
         </ul>
       </div>
killedBy: Login -> Checkout (chained integration) renders each cart line with its price * quantity subtotal
statusReason: expected 'Xác Nhận Đơn HàngSản phẩm:Tổng tiền t…' to contain 'Áo Thun x 3'

[Killed] ArithmeticOperator
src/pages/Checkout.jsx:86:63
         <h3 className="font-semibold mb-2">Sản phẩm:</h3>
         <ul className="list-disc pl-5">
           {cart.map((item, index) => (
-            <li key={index}>{item.name} x {item.quantity} — {(item.price * item.quantity).toLocaleString()} ₫</li>
+            <li key={index}>{item.name} x {item.quantity} — {(item.price / item.quantity).toLocaleString()} ₫</li>
           ))}
         </ul>
killedBy: Login -> Checkout (chained integration) renders each cart line with its price * quantity subtotal
statusReason: expected 'Xác Nhận Đơn HàngSản phẩm:Áo Thun x 3…' to contain '300.000'

[NoCoverage] BlockStatement
src/pages/Checkout.jsx:96:28
         <input
           type="number"
           value={editableTotal}
-          onChange={(e) => {
-            setEditableTotal(Number(e.target.value));
-            setCouponResult(null);
-            setCouponError('');
-          }}
+          onChange={(e) => {}}
           className="border p-2 rounded text-red-600 font-bold"
         />

[Killed] BlockStatement
src/pages/Checkout.jsx:113:28
             type="text"
             placeholder="Nhập mã giảm giá..."
             value={couponCode}
-            onChange={e => { setCouponCode(e.target.value); setCouponResult(null); setCouponError(''); }}
+            onChange={e => {}}
             className="flex-1 border p-2 rounded uppercase"
           />
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] BooleanLiteral
src/pages/Checkout.jsx:118:41
           />
           <button
             onClick={handleApplyCoupon}
-            disabled={applyingCoupon || !couponCode.trim()}
+            disabled={applyingCoupon || couponCode.trim()}
             className="bg-orange-500 text-white px-4 py-2 rounded hover:bg-orange-600 disabled:opacity-50"
           >
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:118:23
           />
           <button
             onClick={handleApplyCoupon}
-            disabled={applyingCoupon || !couponCode.trim()}
+            disabled={false}
             className="bg-orange-500 text-white px-4 py-2 rounded hover:bg-orange-600 disabled:opacity-50"
           >
killedBy: Login -> Checkout (chained integration) disables the "Áp dụng" button while the coupon code input is empty and enables it once typed
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="bg-orange-500 text-white px-4 py-2 rounded hover:bg-orange-600 disabled:opacity-50"
/>
