[Killed] ConditionalExpression
src/pages/Checkout.jsx:124:10
             {applyingCoupon ? '...' : 'Áp dụng'}
           </button>
         </div>
-        {couponError && (
-          <p className="mt-2 text-red-600 text-sm">{couponError}</p>
-        )}
+        {false}
         {couponResult && (
           <div className="mt-2 text-green-700 text-sm space-y-1">
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:124:10
             {applyingCoupon ? '...' : 'Áp dụng'}
           </button>
         </div>
-        {couponError && (
-          <p className="mt-2 text-red-600 text-sm">{couponError}</p>
-        )}
+        {true}
         {couponResult && (
           <div className="mt-2 text-green-700 text-sm space-y-1">
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:127:10
         {couponError && (
           <p className="mt-2 text-red-600 text-sm">{couponError}</p>
         )}
-        {couponResult && (
-          <div className="mt-2 text-green-700 text-sm space-y-1">
-            <p>✅ {couponResult.message}</p>
-            <p>Tiết kiệm: <strong>{couponResult.discount_amount.toLocaleString()} ₫</strong></p>
-            <p>Thành tiền: <strong className="text-lg">{couponResult.final_amount.toLocaleString()} ₫</strong></p>
-          </div>
-        )}
+        {false}
       </div>
 
killedBy: Login -> Checkout (chained integration) applies a coupon and uses its final_amount (not the raw cart total) at checkout, recording usage
statusReason: Unable to find an element with the text: /Tiết kiệm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] LogicalOperator
src/pages/Checkout.jsx:127:10
         {couponError && (
           <p className="mt-2 text-red-600 text-sm">{couponError}</p>
         )}
-        {couponResult && (
-          <div className="mt-2 text-green-700 text-sm space-y-1">
-            <p>✅ {couponResult.message}</p>
-            <p>Tiết kiệm: <strong>{couponResult.discount_amount.toLocaleString()} ₫</strong></p>
-            <p>Thành tiền: <strong className="text-lg">{couponResult.final_amount.toLocaleString()} ₫</strong></p>
-          </div>
-        )}
+        {couponResult || <div className="mt-2 text-green-700 text-sm space-y-1">
+            <p>✅ {couponResult.message}</p>
+            <p>Tiết kiệm: <strong>{couponResult.discount_amount.toLocaleString()} ₫</strong></p>
+            <p>Thành tiền: <strong className="text-lg">{couponResult.final_amount.toLocaleString()} ₫</strong></p>
+          </div>}
       </div>
 
killedBy: Login -> Checkout (chained integration) renders the checkout page heading
statusReason: Cannot read properties of null (reading 'message')

[Killed] StringLiteral
src/pages/Checkout.jsx:147:20
         disabled={loading}
         className="w-full bg-green-600 text-white py-3 rounded hover:bg-green-700 disabled:opacity-50"
       >
-        {loading ? 'Đang xử lý...' : 'Xác Nhận Thanh Toán'}
+        {loading ? "" : 'Xác Nhận Thanh Toán'}
       </button>
     </div>
killedBy: Login -> Checkout (chained integration) shows the transient "..." / "Đang xử lý..." labels while the coupon/checkout requests are in flight
statusReason: Unable to find an element with the text: Đang xử lý.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >
