[Timeout] MethodExpression
src/pages/Checkout.jsx:23:10
   const [applyingCoupon, setApplyingCoupon] = useState(false);
 
   const handleApplyCoupon = async () => {
-    if (!couponCode.trim()) return;
+    if (!couponCode) return;
     setCouponError('');
     setCouponResult(null);

[Killed] OptionalChaining
src/pages/Checkout.jsx:31:18
       const res = await axios.post('http://localhost:3000/api/apply-coupon', {
         code: couponCode.trim().toUpperCase(),
         total_amount: editableTotal,
-        user_id: user?.id || null
+        user_id: user.id || null
       });
       setCouponResult(res.data);
killedBy: Login -> Checkout (chained integration) shows the coupon error message and does not touch the total when the coupon is rejected
statusReason: Unable to find an element with the text: Mã giảm giá không tồn tại. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >

[Killed] ConditionalExpression
src/pages/Checkout.jsx:35:22
       });
       setCouponResult(res.data);
     } catch (err) {
-      setCouponError(err.response?.data?.error || 'Không thể áp dụng mã');
+      setCouponError(false);
     }
     setApplyingCoupon(false);
killedBy: Login -> Checkout (chained integration) falls back to the generic coupon error message on a bare network error (no response object)
statusReason: Unable to find an element with the text: Không thể áp dụng mã. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="max-w-lg mx-auto bg-white p-6 border rounded shadow-sm"
    >
